Documents/ЛБ_ОперацииКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ОперацииКассовойСмены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_КассоваяСмена</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйПКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйРКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КассоваяСмена</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_КассоваяСменаСтатус</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацииКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПКОСводный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКОСводный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйДень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытьКассовыйДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_КассоваяСменаСтатус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_КассоваяСменаСтатус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйДеньЗакрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ОперацииКассовойСмены/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)   
	Движения.ЛБ_КассоваяСмена.Записывать = Истина;
	Если Этотобъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.Открыть Тогда
		Движение = Движения.ЛБ_КассоваяСмена.Добавить();   
		Движение.Период = Дата;
		Движение.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.Открыта;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;    
		Движение.КассоваяСмена = ЭтотОбъект.Ссылка;
		Движение.КассовыйДень = Дата;
		Движение.ПКОСводный = ЭтотОбъект.СводныйПКО;  
		Движение.РКОСводный = ЭтотОбъект.СводныйРКО;
		Движение.Ответственный = ЭтотОбъект.Ответственный;  
	ИначеЕсли Этотобъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.Закрыть Тогда
		ВозвратРезультат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард);
		Если НЕ ВозвратРезультат = неопределено Тогда
			Движение = Движения.ЛБ_КассоваяСмена.Добавить();   
			Движение.Период = Дата;
			Движение.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.Закрыта;
			Движение.КассоваяСмена = ВозвратРезультат.КассоваяСмена;      
			Движение.КассовыйДень = Движение.КассоваяСмена.Дата;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард;
			Движение.РКОСводный = ВозвратРезультат.РКОСводный; 
			Движение.ПКОСводный = ВозвратРезультат.ПКОСводный; 
			Движение.Ответственный = ВозвратРезультат.Ответственный; 
		КонецЕсли;	
	ИначеЕсли Этотобъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.ЗакрытьКассовыйДень Тогда 
		ВозвратРезультат = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(Дата, Организация, Ломбард);
		Если НЕ ВозвратРезультат = неопределено Тогда
		    Движение = Движения.ЛБ_КассоваяСмена.Добавить();   
			Движение.Период = Дата;
			Движение.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.КассовыйДеньЗакрыт; 
			Движение.КассовыйДень = ВозвратРезультат.КассовыйДень;
			Движение.Организация = Организация;
			Движение.Ломбард = Ломбард;    
			Движение.Ответственный = ЭтотОбъект.Ответственный;  
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
